{
    "datasets": [
        {
            "name": "openweather",
            "description": "This API is responsible for providing real time weather data for up to five days in advance in three hour intervals.",
            "link": "https://medium.com/@jspencerpittman/openweather-data-exploration-cedc437a166"
        },
        {
            "name": "psm3",
            "description": "This API is responsible for providing Solar Irradiance data for multiple years with a time resolution of 30 minutes",
            "link": "https://medium.com/@jspencerpittman/nrels-psm3-data-exploration-5b73c1b402a4"
        },
        {
            "name": "windtk",
            "description": "This API is responsible for providing wind measurements at varying altitudes with a time resolution of 30 minutes",
            "link": "https://medium.com/@jspencerpittman/nrels-wind-toolkit-data-exploration-a9c9967099f8"
        },
        {
            "name": "worldclim",
            "description": "This is a dataset that provides climate measurements for 3 decades with a monthly time resolution",
            "link": "https://medium.com/@jspencerpittman/nrels-wind-toolkit-data-exploration-a9c9967099f8"
        }
    ],
    "models": [
        {
            "name": "charlie",
            "description": "The Charlie model employs the WorldClim datasets to forecast the long-term power generation of solar panels. Specifically, it predicts the quantity of power generated over a monthly or annual period. This is accomplished by utilizing average values of monthly climatic variables.",
            "link": "https://medium.com/@jspencerpittman/charlie-model-298c7c9699bf"
        },
        {
            "name": "delta",
            "description": "The Delta model, specifically tailored for solar power, is a hybrid model that specializes in short-term predictions for solar power generation spanning from 1 hour to 5 days in advance. It is trained on the PSM3 dataset, and in conjunction with real-time weather data obtained from openweatherdata, it leverages this information to make accurate real-time solar power forecasts.",
            "link": "https://medium.com/@jspencerpittman/delta-model-3f21a3752125"
        },
        {
            "name": "aeolus",
            "description": "The Aeolus model utilizes wind speed data, which is averaged over five-day intervals and obtained from multiple altitudes. This model employs linear interpolation techniques to estimate wind speeds at different altitudes, thereby enabling the estimation of wind power generation at those altitudes.",
            "link": "https://medium.com/@jspencerpittman/aeolus-model-61804f4576e4"
        },
        {
            "name": "boreas",
            "description": "The Boreas model takes in current wind speeds, temperatures, and distance from the winter solstice to predict wind speeds at higher altitudes and then calculate the energy content of the wind for a given wind turbine.",
            "link": "https://medium.com/@jspencerpittman/aeolus-model-61804f4576e4"
        }
    ]
}